전국영화관 = [{
    지역코드 : '1',
    지역이름 : '서울',
    영화관 : [{
        지점코드 : '101',
        지점명 : '강남CGV',
        주소 : '서울 강남',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    },{
        지점코드 : '102',
        지점명 : '강북CGV',
        주소 : '서울 강북',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    },{
        지점코드 : '103',
        지점명 : '강서CGV',
        주소 : '서울 강서',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    }]
},{
    지역코드 : '2',
    지역이름 : '경기',
    영화관 : [{
        지점코드 : '201',
        지점명 : '안산CGV',
        주소 : '경기 안산',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    },{
        지점코드 : '202',
        지점명 : '수원CGV',
        주소 : '경기 수원',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    },{
        지점코드 : '203',
        지점명 : '시흥CGV',
        주소 : '경기 시흥',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    }]
},{
    지역코드 : '3',
    지역이름 : '부산',
    영화관 : [{
        지점코드 : '301',
        지점명 : '서면CGV',
        주소 : '부산 서면',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    },{
        지점코드 : '302',
        지점명 : '해운대CGV',
        주소 : '부산 해운대',
        일정 : [{
            날짜 : '오늘',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '내일',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        },{
            날짜 : '모레',
            영화 :[{
                관 : '1관',
                영화이름 : [{
                    제목 : '어밴저스',
                    상영시간 : ['17:00','19:00']
                },{
                    제목 : '어밴저스2',
                    상영시간 : ['17:01','19:01']
                }]
            },
            {
                관 : '2관',
                영화이름 : [{
                    제목 : '어밴저스3',
                    상영시간 : ['17:02','19:02']
                },{
                    제목 : '어밴저스4',
                    상영시간 : ['17:03','19:03']
                }]
            }]
        }]
    }]
}]

전국지역출력();

function 전국지역출력(){
    let 전국지역출력구역 = document.querySelector('#전국지역출력구역');

    let html = '';
    for(let i = 0; i<전국영화관.length; i++){
        html += `<span onclick="지역영화관출력(${i})">${전국영화관[i].지역이름}</span>`
    }

    전국지역출력구역.innerHTML = html
}

function 지역영화관출력(지역코드){
    let 지역영화관출력구역 = document.querySelector('#지역영화관출력구역');
    let html = '';
    for(let i = 0; i<전국영화관.length; i++){
        if(전국영화관[i].지역코드 == 지역코드+1){
            for(let j = 0; j<전국영화관[i].영화관.length; j++){
                html += `<span onclick="영화출력(${지역코드},${전국영화관[i].영화관[j].지점코드})">${전국영화관[i].영화관[j].지점명}</span>`
            };
        }
    }

    지역영화관출력구역.innerHTML = html
}

function 영화출력(지역코드,지점코드){
    let 영화출력구역 = document.querySelector('#영화출력구역');
    let html = '';
    for(let i = 0; i<전국영화관.length; i++){
        if(전국영화관[i].지역코드 == 지역코드+1){
            for(let j = 0; j<전국영화관[i].영화관.length; j++){
                if(전국영화관[i].영화관[j].지점코드 == 지점코드){
                    for(let k = 0; k<전국영화관[i].영화관[j].일정.length; k++){
                        html += `<span onclick="시간출력(${지역코드},${지점코드})">${전국영화관[i].영화관[j].일정[k].날짜}</span>`
                    }
                }
            };
        }
    }

    영화출력구역.innerHTML = html
}

function 시간출력(지역코드,지점코드){
    let 시간출력구역 = document.querySelector('#시간출력구역');
    let html = '';
    for(let i = 0; i<전국영화관.length; i++){
        if(전국영화관[i].지역코드 == 지역코드+1){
            for(let j = 0; j<전국영화관[i].영화관.length; j++){
                if(전국영화관[i].영화관[j].지점코드 == 지점코드){
                    for(let k = 0; k<전국영화관[i].영화관[j].일정.length; k++){
                        for(let a = 0; a<전국영화관[i].영화관[j].일정[k].영화.length; a++){
                            html += `<span>${전국영화관[i].영화관[j].일정[k].영화[a].관}</span>`
                        }
                    }
                }
            };
        }
    }

    시간출력구역.innerHTML = html
}
